In [9]:
import pandas as pd
import numpy as np
# Create dummy data
stuff = {'A' : [1,2,3],'B':[4,np.nan,np.nan],'C':[7,8,9],'D':[10,11,12]}

In [10]:
my_df=pd.DataFrame(stuff)
my_df

   A    B  C   D
0  1  4.0  7  10
1  2  NaN  8  11
2  3  NaN  9  12

In [11]:
# Drop rows with null data
my_df.dropna()

   A    B  C   D
0  1  4.0  7  10

In [12]:
# Drop column with null data
my_df.dropna(axis=1)

   A  C   D
0  1  7  10
1  2  8  11
2  3  9  12

In [13]:
# Not permanent ,inplace=False
my_df

   A    B  C   D
0  1  4.0  7  10
1  2  NaN  8  11
2  3  NaN  9  12

In [15]:
# More than one , set threshold
my_df.dropna(thresh=1)

   A    B  C   D
0  1  4.0  7  10
1  2  NaN  8  11
2  3  NaN  9  12

In [17]:
my_df.dropna(thresh=2,axis=1)

   A  C   D
0  1  7  10
1  2  8  11
2  3  9  12

In [19]:
# Replace with fillna()
my_df.fillna(value=31)

   A     B  C   D
0  1   4.0  7  10
1  2  31.0  8  11
2  3  31.0  9  12

In [20]:
# Use math functions
my_df.fillna(value=my_df['B'].mean())

   A    B  C   D
0  1  4.0  7  10
1  2  4.0  8  11
2  3  4.0  9  12

In [21]:
# Use min max
my_df.fillna(value=my_df['B'].min())

   A    B  C   D
0  1  4.0  7  10
1  2  4.0  8  11
2  3  4.0  9  12